Revit 2027 API
IFCProductWrapper.GetAllObjects Method
 Gets all objects associated with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<IFCAnyHandle> GetAllObjects()
Public Function GetAllObjects As ICollection(Of IFCAnyHandle)
public:
ICollection<IFCAnyHandle^>^ GetAllObjects()
member GetAllObjects : unit -> ICollection<IFCAnyHandle>
Return Value
ICollection<IFCAnyHandle>
 The collection of objects.
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace